print('Списки')
# # В списках мы можем хранить разные значения с разными типами данных. Например:
# nums = [1, 2, 3, 4, 5, 6.6, True, False, 'Name', 'Surname']
# print(nums)
#
# # Обращаться к элементам списка мы можем по индексам, которые начинаются с нуля. Например:
# print(nums[0]) # Результатом вывода будет 1
# print(nums[-1]) # Результатом вывода будет Surname
#
# # Также мы можем хранить списки внутри списков. Например:
# names = ['name', ['Ivan', 'Sophia'], 'surname', ['Ivanov', 'Sergeeva']]
# print(names[1]) # Результатом вывода будет ['Ivan', 'Sophia']
#
# # Обратиться к элементам вложеного списка мы можем следующим образом:
# print(names[1][0]) # Результатом вывода будет Ivan





